0/Other/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// epsilon = (0.164 * k**1.5)/(0.07 * L) -->
// epsilon = (0.164 * 0.00375**1.5)/(0.07 * 1) =
// ep = 5.5749e-4

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000557;

boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 0.000557;
        value           uniform 0.000557;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.000557;
    }
    cylinderWall
    {
        type            epsilonWallFunction;
        value           uniform 0.000557;
    }
    backAndFront
    {
        type            empty;
    }
}


// ************************************************************************* //
