0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.113;

boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 0.113;
        value           uniform 0.113;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.113;
    }
    cylinderWall
    {
        type            omegaWallFunction;
        value           uniform 0.113;
    }
    backAndFront
    {
        type            empty;
    }
}


// ************************************************************************* //
