0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
28400
(
(0 -4.9387e-18 -165.04)
(0 -0 0)
(0 -6.56261e-17 0)
(0 6.5847e-17 0)
(0 3.86962e-18 0)
(0 -5.09172e-17 0)
(0 5.46683e-17 0)
(0 -4.49187e-17 0)
...
)
;

boundaryField
{
    farfield
    {
        type            calculated;
        value           nonuniform List<vector> 
440
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    cylinderWall
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(0 4.9387e-18 318.288)
(0 6.91418e-17 305.047)
(0 9.8774e-18 291.334)
(0 -4.9387e-18 277.173)
(0 8.39579e-17 262.584)
(0 -9.8774e-18 247.59)
(0 4.9387e-18 232.215)
(0 7.94778e-17 216.481)
...
)
;
    }
    backAndFront
    {
        type            empty;
    }
}


// ************************************************************************* //
